"use strict";
//=========================================================================================
// 5.1. Таймер. Властивість seconds  і метод tick (викорстати параметр this)
//=========================================================================================
// 6. Функція-композитор. Напиши функцію яка приймає кілька функцій і повертає нову, 
// що виконує їх послідовно зліва направо (і результат попередньої і вхідним параметром для наступної).
//=========================================================================================
// 7. Логгер з рівнем важливості. Функція приймає повідомлення і рівень важливості ("info", "warn" , "error").
